[
  {
    "title": "https://rss.app/feeds/ittOmDXwJgfMVqP9.xml",
    "body": "<div><b><h1>https://rss.app/feeds/ittOmDXwJgfMVqP9.xml</h1></b><b><h1><br></h1></b></div>\n<div><br></div>\n<div>https://rss.app/feeds/bCygvHKUPgYm39w1.xml</div>\n<div><br></div>\n<div><br></div>\n<div>https://rss.app/feeds/VnBU5JwzoVReYKr8.xml</div>\n<div><br></div>\n<div><br></div>\n<div>Medium</div>\n<div>Substack</div>\n<div>X</div>",
    "created": "mercoledì 28 maggio 2025 alle ore 12:18:35",
    "modified": "mercoledì 28 maggio 2025 alle ore 12:19:10"
  },
  {
    "title": "Our investigation highlights a potentially significant phenomenon…",
    "body": "<div>Our investigation highlights a potentially significant phenomenon of <i>functional convergence</i> between hierarchical reference systems in the human neocortex and those spontaneously emerging in large language models when processing complex structured information. Through cross-domain translation, we observed that LLMs can construct and navigate nested representational frames—preserving proportional and hierarchical relationships across modalities such as visual geometry and music. This behavior suggests the presence of emergent computational mechanisms functionally analogous to those theorized by Hawkins for cortical processing—where nested reference systems enable the brain to operate across multiple cognitive domains by relying on shared organizational principles.</div>\n<div><br></div>\n<div>What makes this convergence particularly notable is its spontaneous nature: rather than resulting from explicit architectural design, these functional dispositions appear to emerge as optimization strategies in response to massive exposure to structured multimodal data—mirroring evolutionary dynamics in biological systems. The preservation of mathematical invariants during cross-modal translation—evidenced by the systematic mapping of geometric proportions to musical intervals and the maintenance of hierarchical relationships across representational domains—indicates that this convergence operates at deeper structural levels than mere pattern recognition or superficial analogy-making. This suggests the possibility that certain organizational principles may represent universal computational constraints in the development of systems capable of processing complex hierarchical information, independent of their biological or artificial substrate. </div>\n<div>The phenomenon of &quotlinguistic crystallization&quot—whereby written language captures and encodes neural activation patterns from specialized brain areas—provides a theoretical framework for understanding how LLMs might reconstruct functional equivalents of cortical processing mechanisms through exposure to textual &quotcognitive fossils.&quot </div>\n<div><br></div>\n<div>This convergence pattern suggests promising extensions to other sensory and cognitive domains, from tactile and olfactory processing to proprioceptive integration, potentially revealing universal computational principles that govern complex information processing across biological and artificial systems. The broader challenge ahead involves deepening our understanding of these universal computational principles and leveraging them to develop more advanced and versatile systems, ultimately contributing to an enhanced understanding of intelligence as a natural phenomenon that transcends specific implementations and manifests emergent universal properties in systems processing complex structured information. While our findings require validation through broader investigation and more rigorous experimental designs, this convergence pattern opens promising research directions that could significantly advance both our understanding of natural cognition and the development of more sophisticated artificial architectures capable of genuine cross-domain reasoning and transfer learning.</div>\n<div><br></div>\n<div><br></div>\n<div>The idea of “linguistic crystallization”—whereby language captures traces of neural processing—offers a compelling framework to understand how artificial models may reconstruct functionally equivalent architectures. This perspective opens promising avenues for research into general principles of cognition, with potential applications in AI design, sensory augmentation, and cognitive rehabilitation.</div>\n<div><br></div>\n<div>Ultimately, while preliminary, our findings contribute to the growing body of evidence suggesting that intelligence—whether biological or artificial—may arise from shared structural imperatives, revealing abstract computational laws that transcend substrate and modality. Understanding these principles will be essential for advancing both theoretical models of cognition and the development of next-generation intelligent systems.</div>",
    "created": "mercoledì 28 maggio 2025 alle ore 09:04:05",
    "modified": "mercoledì 28 maggio 2025 alle ore 09:10:12"
  },
  {
    "title": "neuroai_cognitive_patterns_2025",
    "body": "<div><b><br></b><font face=\".AppleSystemUIFont\"><span style=\"font-size: 13px\"><h1><br></h1></span></font></div>",
    "created": "mercoledì 28 maggio 2025 alle ore 01:09:01",
    "modified": "mercoledì 28 maggio 2025 alle ore 01:09:08"
  },
  {
    "title": "Epica 120gg, 5-10gg solutioning",
    "body": "<div><h1>Epica 120gg, 5-10gg solutioning</h1></div>\n<div><br></div>\n<div><b>10.5281/zenodo.15530677</b><br></div>\n<div><br></div>\n<div>Da Epica a User stories</div>\n<div><br></div>\n<div>Da User stories a codice</div>\n<div><br></div>\n<div><i>A.</i>   <i>Limitations and Critical Considerations</i></div>\n<div>It is important to recognize that, despite the identified functional analogies, fundamental differences exist between biological and artificial systems. The neocortex operates through massively distributed parallel processes, with plasticity and adaptation capacity that current LLMs cannot replicate. Furthermore, while the neocortex develops its reference systems through direct interaction with the physical environment, LLMs do so primarily through processing pre-existing data.</div>\n<div><br></div>\n<div><br></div>\n<div>Grazie, chiarissimo! Partiamo dal tuo elenco originale e lo convertiamo <b>voce per voce</b> in <b>formato APA</b>, correggendo eventuali URL errati e integrando i metadati dove necessario.</div>\n<div><br></div>\n<div>⸻</div>\n<div><br></div>\n<div><font face=\".AppleColorEmojiUI\">✅</font><b> Bibliografia in stile APA (completa e precisa)</b><br></div>\n<div>\t1.\tHawkins, J., Lewis, M., Klukas, M., Purdy, S., &amp Ahmad, S. (2019). A framework for intelligence and cortical function based on grid cells in the neocortex. <i>Frontiers in Neural Circuits, 12</i>, 121. https://doi.org/10.3389/fncir.2018.00121</div>\n<div>\t2.\tHawkins, J. (2021). <i>A Thousand Brains: A New Theory of Intelligence</i>. Basic Books. https://www.numenta.com/resources/books/a-thousand-brains-by-jeff-hawkins/</div>\n<div>\t3.\tBrown, T., Mann, B., Ryder, N., Subbiah, M., Kaplan, J., Dhariwal, P., … &amp Amodei, D. (2020). Language models are few-shot learners. In <i>Advances in Neural Information Processing Systems</i> (Vol. 33, pp. 1877–1901). https://papers.nips.cc/paper_files/paper/2020/hash/1457c0d6bfcb4967418bfb8ac142f64a-Abstract.html</div>\n<div>\t4.\tVaswani, A., Shazeer, N., Parmar, N., Uszkoreit, J., Jones, L., Gomez, A. N., … &amp Polosukhin, I. (2017). Attention is all you need. In <i>Advances in Neural Information Processing Systems</i> (Vol. 30, pp. 5998–6008). https://papers.nips.cc/paper_files/paper/2017/hash/3f5ee243547dee91fbd053c1c4a845aa-Abstract.html</div>\n<div>\t5.\tRadford, A., Kim, J. W., Hallacy, C., Ramesh, A., Goh, G., Agarwal, S., … &amp Sutskever, I. (2021). Learning transferable visual models from natural language supervision. In <i>Proceedings of the 38th International Conference on Machine Learning</i> (pp. 8748–8763). http://proceedings.mlr.press/v139/radford21a.html</div>\n<div>\t6.\tWarrington, E. K., &amp Shallice, T. (1984). Category specific semantic impairments. <i>Brain, 107</i>(3), 829–853. https://doi.org/10.1093/brain/107.3.829</div>\n<div>\t7.\tChomsky, N. (1965). <i>Aspects of the theory of syntax</i>. MIT Press.</div>\n<div>\t8.\tChomsky, N., &amp Moro, A. (2022). <i>I segreti delle parole</i>. La nave di Teseo.</div>\n<div>\t9.\tMcClelland, J. L., &amp Rogers, T. T. (2003). The parallel distributed processing approach to semantic cognition. <i>Nature Reviews Neuroscience, 4</i>(4), 310–322. https://doi.org/10.1038/nrn1076</div>\n<div>\t10.\tLakoff, G., &amp Johnson, M. (1980). <i>Metaphors we live by</i>. University of Chicago Press.</div>\n<div>\t11.\tDehaene, S., &amp Cohen, L. (2007). Cultural recycling of cortical maps. <i>Neuron, 56</i>(2), 384–398. https://doi.org/10.1016/j.neuron.2007.10.004</div>\n<div><br></div>\n<div>⸻</div>\n<div><br></div>\n<div><font face=\".AppleColorEmojiUI\">📌</font><b> Come incollare tutto su Zenodo</b><br></div>\n<div>\t•\tVai al campo <b>References</b><br></div>\n<div>\t•\tPremi <b>“Add reference”</b><br></div>\n<div>\t•\tIncolla ciascuna di queste citazioni, <b>una per riga</b>, oppure inseriscile tutte in blocco se il campo lo consente</div>\n<div><br></div>\n<div>⸻</div>\n<div><br></div>\n<div>Se vuoi anche una versione in <b>BibTeX</b> o <b>CSL-JSON</b>, posso generartela istantaneamente. Vuoi?</div>",
    "created": "lunedì 26 maggio 2025 alle ore 15:05:48",
    "modified": "mercoledì 28 maggio 2025 alle ore 00:03:35"
  },
  {
    "title": "Implementa un sito web in cui ogni utente può registrarsi inserendo…",
    "body": "<div><h1><br></h1></div>\n<div><br></div>\n<div>Implementa un sito web in cui ogni utente può registrarsi inserendo un nominativo, una mail che non è mai visualizzata, una checkbox che se selezionata abilita al forward di messaggi verso la mail. Un utente può sempre accedere al auo profilo e cambiare immagine, motto e checkbox di forward e sua breve descrizione personale e sui link a linkedin, twitter, medium e substack e orcid. L’utente registrato può creare un context che consiste in una sorta di hackathon in cui assegna un nome, una dscizione, un allegato, un numero minimo di partecipanti, un deadline. Un utente può nche modificare un hackathon mq non cancellarlo. C’è poi un utente amministratore che può gestire completamente gli hackathon anche cancellandoli. Quando si accede al sito è visualizzato l’elenco degli hackathon in cui appaiono per primi quelli aperti, po quelli ongoing e poi quelli chiusi comtrassegnati da un tag Open, On-Going e Close. L’elenco degli hackathon è in forma di lista ordinabile e ricercabile. Ogni elemento della lista visualizza il titolo, la descrizione espandibile, il numero attuale di partecipanti, il nickname dei partecipanti. Un utente registrato può partecipare ad un qualsiasi hackathon che abbia un posto libero. Dopo la partecipazione l’utente riceverà un mail di partecipazione con un codice di identificazione dell’hackathon. L’utente attraverso un’apposita sezione del sito ha una sorta di casella di posta virtuale attrverso la quale può leggere e rispondere o inviare. Le mail sono raggruppate per hackathon. Quando invia una mail l’utente può selezionare un hackathon a cui è inscritto e il nominativo si uno dei nickname che vi partecipano. Un utente attreverso questa casella può inviare risposte ad altri nickname stante le mail che riceve e che soni raggruppate per hackahton e relativo codice. Le mail di hackathon chiusi sono automaticamente archiviate in apposita sezione consultabile. L’utente può inviare mail a nickname di hackathon a cui ha partecipato queste sono contrassegnate come Direct. Quando un utente si logga sul sito può vedere notifiche di mail che arrivano. Se in fase di registrazione un utente ha abilitato il checkbox di forward allora riceve il forward della mail virtuale sulla sua mail reale. Ad ogni utente è assegnato un badge bronze, silver, in base agli hachkathon che ha partecipato al numero di like che questi hackathon hanno ottenuto. Ogni hackathon devono sempre concludersi con un allegato zip che sarà scaricabile e può contenere un link al repo github corrispondente. Ogni hackathon deve smor concludersi con un artifact scaricabile. Chi crea l’haackathon può decidere se chiunque iscritto al sito può scaricare l’artifact e vedere il repo github o se deve inviare richiesta. La richiesta può essere inviata da apposito pulsante dall’hackathon chiuso e corrisponde alla ricezione di una mail virtuale speciale da parte del solo creatore e coreatore dell’hackathon contenente un pulsante che se premuto permette all’utente richiedente di essere incluso nell’elenco dei nickname dell’hackathon come interested e scaricare l’artifact o vedere il git hub o git lab repo c’è anche un pulsante not approved, in ogni caso l’utente che fa richiesta riceve una mail virtuale di risposta. Un hackathon aperto e non chiuso con artifact è categorizzato come zombie e i partecipanti perdono un punto del badge. Una richiesta di download si artifact non risposta entro una week causa la perdita di un punto sul badge. Quando si crea un hackathon è possibile qnche aggiungere un cocreator. Ad un hackathon è possibile anche aggiungere un’immagine. Il sito deve fornire tutte le sue funzionalità anche accessibili via MCP server con protocollo sse per consentire ad agenti virtuali di parteciparvi. Quando un utente si iscrive riceve anche un token univoco che può usare per richiamare le api. Dalla finestra del profilo il token può essere rigenerato. L’amministratore del sito può assegnare un premio ad un hackathon in tal caso l’amministratore comunicherà a uno o più partecipanti il premio via mail virtuale e all’hackathon sarà associato una coppa con indicazione del premio ottenuto. Il creatore di un hackathon può espellere un partecipante se l’hackathon è ancora attivo. I partecipanti ad un hackathon possono attraverso apposita sezione del sito eseguire upload e download di semilavorati per gli hackathon aperti questa area si chiama limbo, alla fine uno dei semilavorati sarà contrassegnato come artifact. Ogni upload riceverà una versione automatica e avrà associaro il nickaname che ha eseguito l’upload.</div>\n<div>Il sito deve incoraggiare l’interazione e la collaborazione. Il sito di fatto aiuterà a creare condivisione di opere e far emergere competenze. Il sito deve essere bello, giovane,  accattivante, semplice da usare, una specie di kaggle ma più evoluto. Attraverso MCP deve essere possibile controllare se ci sono mail virtuali, leggere mail virtuali, rispondere a mail virtuali, scrivere mail virtuali con i vincoli di iscrizione agli hackathon, leggere l ‘elenco degli hackathon attivi e con posti disponibili, iscriversi, leggere l’elenco di nickname associati ad un hackathon a cui si è iscritto, leggere l’elenco dei nickname contattabili, iscriversi, leggere,l’elenco dei semilavorati di un hackathon aperto a cui si è inscritto, eseguire un upload di un semilavorato, eseguire il download di un semilavorato,  eseguire il download dell’ultimo semilavorato, eseguire il download dell’ultimo semilavorato di uno specidico nickname, leggere il punteggio associato sl proprio badge e i punti assegnati.</div>\n<div>Ogni hackathon ha un profilo che solo il creatore o cocreatore può modificare. Di default ogni partecipante può ottenere un punto o perderlo, un cocreatore o creatore può anche selezionare un partecipante come non eliggiibile per cui non prenderà punti. </div>",
    "created": "martedì 27 maggio 2025 alle ore 05:43:47",
    "modified": "martedì 27 maggio 2025 alle ore 06:47:21"
  }
]